#pragma once
#include<string>
#include<iostream>
#include<vector>
#include"Place.h"
#include"Enemy_Ctl.h"

using namespace std;

int day = 0;
int max_day = 27;
bool dead = false;

int nextmap[10][3] = {
1,0,0,
2,3,0,
5,0,0,
4,0,0,
5,0,0,
6,7,8,
9,0,0,
9,0,0,
9,0,0,
0,0,0 };

// 名字，等级，长度，描述
Place site[10] = {
Place("沧海镖局",1,1,"你准备从镖局出发,请准备妥当！"),
Place("梁州城",1,3,"你来到了梁州城，这里是西部的商业大城，有许多商贩走卒。但最近城内潜入了一批盗贼，请小心提防。"),
Place("琅琊群山",2,5,"你来到了琅琊群山，这里山脉延绵，多有劫匪和野兽出没，其中红狼帮更是一方霸主。"),
Place("天泉山庄",2,3,"你来到了天泉山庄，这里是龙泉剑派的土地，此派弟子十分好战，但他们为人正直，并不会下死手。"),
Place("槐都",3,4,"你来到了槐都，这里是长生教的势力范围，他们诡异莫测，需时刻警惕。"),
Place("平安客栈",3,4,"你来到了平安客栈，这里是东西交通线上的歇脚处，店内鱼龙混杂，常有邪派弟子的踪影。"),
Place("武当山",4,4,"你来到了武当山，这里是武当派所属。此时武当正值内乱，一伙武当叛徒逃离了宗门。"),
Place("燕王府",4,3,"你来到了燕王府，这是燕王的封地。但最近燕王蠢蠢欲动，意欲谋反。"),
Place("百草药谷",5,5,"你来到了百草药谷，这里有多种毒物和猛兽。传说有妖物出没。"),
Place("京城",5,4,"你来到了京城，目的地就在眼前，但你觉得事情远没有那么简单......") };

Enemy_Ctl enemy[20] = {   ///string name, int xp, int HP, int power, int speed, int defense, int level, int money, string des
Enemy_Ctl("同门剑师", 5, 1, 20, 20, 0, 1, 10, "你闲来无事，与同门师兄切磋了起来。"),
Enemy_Ctl("同门武师", 5, 1, 20, 20, 0, 1, 10, "你闲来无事，与同门师兄切磋了起来。"),
Enemy_Ctl("强盗", 5, 1, 20, 20, 0, 1, 10, "一伙强盗趁着夜色打劫了你的车队，威胁你交出所有货物"),
Enemy_Ctl("飞贼", 5, 1, 20, 20, 0, 1, 10, "几个飞贼盯上了你，你与他们开始了周旋。"),
Enemy_Ctl("土匪", 5, 1, 20, 20, 0, 1, 10, "一队土匪拦在了你的面前，他们说，如果你跪地求饶并交出财物，就给你一种利落的死法。"),
Enemy_Ctl("野狼", 5, 1, 20, 20, 0, 1, 10, "一群野狼似乎把你当成了食物......"),
Enemy_Ctl("龙泉弟子", 5, 1, 20, 20, 0, 1, 10, "你偶遇龙泉弟子，对方听闻你的名字，兴奋地要与你切磋。"),
Enemy_Ctl("龙泉剑客", 5, 1, 20, 20, 0, 1, 10,"你偶遇龙泉剑客，对方想试试你的身手。"),
Enemy_Ctl("长生教长老", 5, 1, 20, 20, 0, 1, 10,"一名长生教长老走到了你跟前，他说想要你的心肝炼药。"),
Enemy_Ctl("长生教护法", 5, 1, 20, 20, 0, 1, 10,"你发现了一名长生教护法跟踪你，虽然不知道他想干什么，但你决定先下手为强。"),
Enemy_Ctl("邪教密探", 5, 1, 20, 20, 0, 1, 10,"你发现了邪教密探，所谓正邪不两立，杀！"),
Enemy_Ctl("邪教头目", 5, 1, 20, 20, 0, 1, 10,"邪教头目袭击了客栈，不能让他们的阴谋得逞。"),
Enemy_Ctl("武当弃徒", 5, 1, 20, 20, 0, 1, 10,"被逐出师门的武当叛徒们落草为寇，他们盯上了你。"),
Enemy_Ctl("入魔弟子", 5, 1, 20, 20, 0, 1, 10,"多名武当叛徒包围了你，他们似乎有些不对劲......"),
Enemy_Ctl("燕王叛军", 5, 1, 20, 20, 0, 1, 10,"燕王叛军向你发动了进攻，绝不能让朝廷机密落入他们手中。"),
Enemy_Ctl("燕王叛将", 5, 1, 20, 20, 0, 1, 10,"燕王叛将率领人马想将你葬身于此。"),
Enemy_Ctl("猛虎", 5, 1, 20, 20, 0, 1, 10,"突然蹿出几只斑斓白额大虫，狭路相逢勇者胜！"),
Enemy_Ctl("蛇妖", 5, 1, 20, 20, 0, 1, 10,"蛇群从四面向你袭来，当心它们的毒牙！"),
Enemy_Ctl("东厂刺客", 5, 1, 20, 20, 0, 1, 10,"东厂刺客从隐蔽处冒出，想取你性命！"),
Enemy_Ctl("东厂首领", 5, 1, 20, 20, 0, 1, 10,"东厂首领堵住了去路，用高官厚禄劝你投降，但你断然拒绝。"),
};

//string name, int xp, int HP, int power, int speed, int defense, int level, int money, string des
Enemy_Ctl boss[10] = {
Enemy_Ctl("师傅", 5, 1, 20, 20, 0, 1, 10,"即将出发前，你的师傅仍放心不下你，想再教授你些武艺。"),
Enemy_Ctl("盗圣", 5, 1, 20, 20, 0, 1, 10,"梁州城的夜色下，传闻中的盗圣拦在了出城口，他似乎对你护送的朝廷机密非常感兴趣。"),
Enemy_Ctl("红狼帮帮主", 5, 1, 20, 20, 0, 1, 10,"远处忽然尘土飞扬，红狼帮帮主杀到你的面前，他横刀于前，要为他的手下报仇。"),
Enemy_Ctl("天泉山庄庄主", 5, 1, 20, 20, 0, 1, 10,"你正欲离开山庄时，伴随着一阵豪爽的笑声，天泉山庄庄主轻功踱步而来，显然只有陪他打到尽心，他才会放你离开。"),
Enemy_Ctl("长生教教主", 5, 1, 20, 20, 0, 1, 10,"长生教在城内举行了秘法，他们似乎要用活人献祭，探明真相的你决定阻止他们。"),
Enemy_Ctl("客栈掌柜", 5, 1, 20, 20, 0, 1, 10,"没想到客栈掌柜早已被邪教掉包，你陷入了邪教的埋伏中。"),
Enemy_Ctl("武当副掌门", 5, 1, 20, 20, 0, 1, 10,"没想到客栈天下正派的武当也已经堕落，武当的副掌门投靠了朝廷奸人，欲于此地截杀你。"),
Enemy_Ctl("燕王", 5, 1, 20, 20, 0, 1, 10,"燕王终于撕开了他虚伪的面具，背叛了朝廷，如今你只能破釜沉舟，拼死一搏。"),
Enemy_Ctl("千年树妖", 5, 1, 20, 20, 0, 1, 10,"大地猛地剧烈摇晃起来，黑色的藤曼从四面涌来，原来传说中的妖物真的存在......"),
Enemy_Ctl("魏公公", 5, 1, 20, 20, 0, 1, 10,"幕后主使终于现身......原来这一路上的种种都是魏公公的阴谋，你所护送的正是他谋反乱政的证据，朝廷的危亡就系于这一战！")
};

