#pragma once
#include<string>
#include<iostream>
#include<vector>
#include"Place.h"
#include"Enemy_Ctl.h"

using namespace std;

int day = 0;
int max_day = 27;
bool dead = false;

int nextmap[10][3] = {
1,0,0,
2,3,0,
5,0,0,
4,0,0,
5,0,0,
6,7,8,
9,0,0,
9,0,0,
9,0,0,
0,0,0 };

// 名字，等级，长度，描述
Place site[10] = {
Place("沧海镖局",1,1,"你准备从镖局出发,请准备妥当！"),
Place("梁州城",1,3,"你来到了梁州城，这里是西部的商业大城，有许多商贩走卒。但最近城内潜入了一批盗贼，请小心提防。"),
Place("琅琊群山",2,5,"你来到了琅琊群山，这里山脉延绵，多有劫匪和野兽出没，其中红狼帮更是一方霸主。"),
Place("天泉山庄",2,3,"你来到了天泉山庄，这里是龙泉剑派的土地，此派弟子十分好战，但他们为人正直，并不会下死手。"),
Place("槐都",3,4,"你来到了槐都，这里是长生教的势力范围，他们诡异莫测，需时刻警惕。"),
Place("平安客栈",3,4,"你来到了平安客栈，这里是东西交通线上的歇脚处，店内鱼龙混杂，常有邪派弟子的踪影。"),
Place("武当山",4,4,"你来到了武当山，这里是武当派所属。此时武当正值内乱，一伙武当叛徒逃离了宗门。"),
Place("燕王府",4,3,"你来到了燕王府，这是燕王的封地。但最近燕王蠢蠢欲动，意欲谋反。"),
Place("百草药谷",5,5,"你来到了百草药谷，这里有多种毒物和猛兽。传说有妖物出没。"),
Place("京城",5,4,"你来到了京城，目的地就在眼前，但你觉得事情远没有那么简单......") };

Enemy_Ctl boss[10] = {
Enemy_Ctl("师傅", 1, 1, 1, 1, 1,"即将出发前，你的师傅仍放心不下你，想再教授你些武艺。"),
Enemy_Ctl("盗圣", 1, 1, 1, 1, 1,"梁州城的夜色下，传闻中的盗圣拦在了出城口，他似乎对你护送的朝廷机密非常感兴趣。"),
Enemy_Ctl("红狼帮帮主", 1, 1, 1, 1, 1,"远处忽然尘土飞扬，红狼帮帮主杀到你的面前，他横刀于前，要为他的手下报仇。"),
Enemy_Ctl("天泉山庄庄主", 1, 1, 1, 1, 1,"你正欲离开山庄时，伴随着一阵豪爽的笑声，天泉山庄庄主轻功踱步而来，显然只有陪他打到尽心，他才会放你离开。"),
Enemy_Ctl("长生教教主", 1, 1, 1, 1, 1,"长生教在城内举行了秘法，他们似乎要用活人献祭，探明真相的你决定阻止他们。"),
Enemy_Ctl("客栈掌柜", 1, 1, 1, 1, 1,"没想到客栈掌柜早已被邪教掉包，你陷入了邪教的埋伏中。"),
Enemy_Ctl("武当副掌门", 1, 1, 1, 1, 1,"没想到客栈天下正派的武当也已经堕落，武当的副掌门投靠了朝廷奸人，欲于此地截杀你。"),
Enemy_Ctl("燕王", 1, 1, 1, 1, 1,"燕王终于撕开了他虚伪的面具，背叛了朝廷，如今你只能破釜沉舟，拼死一搏。"),
Enemy_Ctl("千年树妖", 1, 1, 1, 1, 1,"大地猛地剧烈摇晃起来，黑色的藤曼从四面涌来，原来传说中的妖物真的存在......"),
Enemy_Ctl("魏公公", 1, 1, 1, 1, 1,"幕后主使终于现身......原来这一路上的种种都是魏公公的阴谋，你所护送的正是他谋反乱政的证据，朝廷的危亡就系于这一战！")
};

